description = {
    'Presente indicativo': {
        '1: Настоящее время': {
            'Использование 1:': 'Факты и утверждения. Не для краткосрочных процессов.',
            'Пример:': 'El niño no come pescado.<br>Ребёнок не ест рыбу (никогда).'
        },
        '2: Условие "если"': {
            'Использование 2:': 'Вероятное и возможное условие, в настоящем времени и в будущем ("если").',
            'В сочетании с:': 'Предложениями в настоящем времени или в будущем.',
            'Пример:': 'Si llueve mañana, me quedaré en casa.<br>Если завтра будет дождь, я останусь дома.'
        }
    },
    'Presente con Estar': {
        'Краткосрочный и постоянный процесс в настоящем времени': {
            'Использование:': 'Факты и утверждения. Для краткосрочных и постоянных процессов в настоящем времени.',
            'Пример:': 'Están durmiendo.<br>Они спят.'
        }
    },
    'Preterito perfecto compuestas comunes': {
        'Расширенное прошедшее время': {
            'Использование:': 'Факты и утверждения. Продолжающееся действие/Может повторяться/Пока нет, но ещё возможно.',
            'Примеры:': '''Ha llovido todo el día.<br>Весь день идёт дождь.<br>
                           Me ha llamado cinco veces hoy.<br>Сегодня он/она звонила мне уже пять раз.<br>
                           No hemos tenido problemas con este ascensor.<br>У нас не было проблем с этим лифтом.'''
        }
    },
    'Preterito perfecto compuestas comunes con Estar': {
        'Процесс за последнее время': {
            'Использование:': 'Факты и утверждения. Продолжающийся процесс за последнее время.',
            'Пример:': 'He estado viajando por tres semanas.<br>Я путешествую уже три недели.'
        }
    },
    'Preterito indicativo': {
        'Прошедшее время совершенного вида': {
            'Использование:': 'Факты и утверждения. Описание целого, завершенного действия в прошлом.',
            'Пример:': 'Compré frutas ayer.<br>Вчера я купил фрукты.'
        }
    },
    'Imperfecto indicativo': {
        'Прошедшее время несовершенного вида': {
            'Использование:': 'Факты и утверждения. Описание части действия или обычай в прошлом.',
            'Схема:': 'Корень + aba/ía.',
            'Пример:': 'Yo <u>jugaba</u> en este parque cuando era niño.<br>Я играл в этом парке когда был ребёнком.'
        }
    },
    'Pasado continuo': {
        'Процесс в прошлом': {
            'Использование:': 'Факты и утверждения. Описание краткосрочного процесса, во время момента в прошлом.',
            'В сочетании с:': 'Предложениями в прошедшем времени совершенного вида.',
            'Пример:': '<u>Estábamos comiendo</u> cuando sonó la alarma.<br>Мы ели, когда сработала сигнализация.'

        }
    },
    'Pluscuamperfecto compuestas comunes': {
        'Действие завершилось до другого момента в прошлом': {
            'Использование:': 'Факты и утверждения. Действие завершилось до другого момента в прошлом.',
            'В сочетании с:': 'Предложениями в прошедшем времени совершенного вида.',
            'Пример:': '''Ya <u>habían inventado</u> el ascensor cuando construyeron estos edificios.<br>
                          Лифт уже был изобретен когда строили эти здания.'''
        }
    },
    'Preterito anterior indicativo': {
        'Процесс завершился как условие для другого действия': {
            'Использование:': 'Факты и утверждения. Условие завершилось и затем последовало другое действие ("после того, как").',
            'В сочетании с:': 'Предложениями в прошедшем времени совершенного вида.',
            'Пример:': '''Cuando <u>hube terminado</u> el trabajo, me pagaron.<br>
                          После того, как я закончил работу, они мне заплатили.'''
        }
    },
    'Pluscuamperfecto continuo': {
        'Краткосрочный процесс до другого момента в прошлом': {
            'Использование:': 'Факты и утверждения. Краткосрочный и постоянный процесс до другого момента в прошлом.',
            'В сочетании с:': 'Предложениями в прошедшем времени совершенного вида.',
            'Пример:': '''Yo <u>había estado leyendo</u> sobre canguros cuando me ofrecieron viajar a Australia.<br>
                          Я <u>был занят чтением</u> о кенгуру, когда мне предложили поехать в Австралию.'''
        }
    },
    'Intencion interrumpida': {
        '1: Прерванное намерение': {
            'Использование 1:': 'Факты и утверждения. Прерванное намерение ("собирался").',
            'В сочетании с:': 'Предложениями в прошедшем времени.',
            'Пример:': '''<u>Íbamos a comprar</u> una computadora nueva pero nos dijeron que es más barato reparar la vieja.<br>
                          Мы собирались купить новый компьютер, но нам сказали, что дешевле отремонтировать старый.'''
        },
        '2: Предсказание в прошлом': {
            'Использование 2:': 'Предсказание в прошлом.', 
            'В сочетании с:': 'Предложениями в прошедшем времени.',
            'Пример:': 'Creíamos que <u>ibas a llegar</u> más tarde.<br>Мы думали, что ты <u>доберёшься</u> позже.'
        }
    },
    'Imperativo afirmativo': {
        'Утвердительное повелительное наклонение': {
            'Пример:': '¡Miren qué lindo edificio!<br>Посмотрите, какое красивое здание!'
        }
    },
    'Imperativo negativo': {
        'Отрицательное повелительное наклонение': {
            'Пример:': '¡No toques esos cables!<br>Не трогай эти кабели!'
        }
    },
    'Cohortativo afirmativo': {
        'Гортатив (утвердительный)': {
            'Использование:': '''Призыв к действию с намерением участвовать в реализации желаемой ситуации 
                                 ("Давайте сделаем!").''',
            'Пример:': 'Hablemos mañana.<br>Давай поговорим завтра.'
        }
    },
    'Cohortativo negativo': {
        'Гортатив (отрицательный)': {
            'Использование:': '''Призыв к бездействию с намерением говорящего самому участвовать в реализации желаемой ситуации 
                                 ("Давайте не будем делать!").''',
            'Пример:': 'No nos peleemos.<br>Давайте не будем спорить.'
        }
    },
    'Futuro con Ir a': {
        '1: Будущее время (с вспомогательным глаголом)': {
            'Использование 1:': 'Обещания и предсказания. Будущее время (с вспомогательным глаголом).',
            'Пример:': 'Voy a comprar frutas.<br>Я куплю фрукты (я собираюсь купить фрукты).'
        },
        '2: Недоверие о настоящем времени или о будущем': {
            'Использование 2:': 'Удивление, недоверие, неодобрение или замешательство о настоящем времени или о будущем.',
            'Примеры:': '''¿Cómo vas a hacer algo tan insensato?<br>Как ты можешь совершить такой безрассудный поступок!?<br>
                           ¡Qué va a ser millonario! ¡Es mitómano!<br>Какой из него миллионер!? Он - лжец!'''
        }
    },
    'Futuro indicativo': {
        '1: Будущее время': {
            'Использование 1:': 'Обещания и предсказания. Будущее время.',
            'Пример:': 'Volveremos la semana que viene.<br>Мы вернёмся на следующей неделе.'
        },
        '2: Гипотеза о настоящем времени': {
            'Использование 2:': 'Задаваться вопросом, интересоваться или гипотеза о настоящем времени.',
            'Примеры:': '''No sabrá qué hacer.<br>Разве он может не знать, что делать!?<br>
                           ¿Estará vivo Elvis?<br>Разве Элвис жив!?'''

        }
    },
    'Preterito perfecto compuestos del subjuntivo': {
        '1: Процесс будет завершён как условие для другого действия': {
            'Использование 1:': '''Обещания и предсказания. 
                                   Условие будет завершено, за которым последует другое действие ("после того, как").''', 
            'В сочетании с:': 'Предложениями в будущем.',
            'Пример:': '''Cuando <u>hayas terminado</u> de leer el manual, podrás resolver el problema.<br>
                          После того, как закончишь читать инструкцию, ты сможешь решить проблему.'''
        },
        '2: Сослагательное наклонение 1 ограничено прошлым': {
            'Использование 2:': 'Придаточное предложение после "чтобы" или "что" ограничено прошлым.',
            'В сочетании с:': 'Предложениями в настоящем времени или в прошедшем времени совершенного вида.',
            'Примеры:': '''Los documentos no demuestran que <u>haya vivido</u> en otro país.<br>
                           Документы не доказывают, что он проживал в другой стране.<br>
                           No creo que él <u>se haya dado</u> cuenta.<br>
                           Я не думаю, что он заметил.
                           '''
        }
    },
    'Futuro perfecto compuestas comunes': {
        '1: Действие будет завершено до другого момента в будущем': {
            'Использование 1:': 'Обещания и предсказания. Действие будет завершено до другого момента в будущем.',
            'В сочетании с:': 'Предложениями "Сослагательное наклонение 1".',
            'Пример:': '''Cuando lleguemos <u>habrán cerrado</u> las puertas.<br>
                          Когда мы доберёмся, двери будут закрыты (сейчас они ещё открыты).'''
        },
        '2: Гипотеза о прошлом': {
            'Использование 2:': '''Гипотеза или задаваться вопросом, интересоваться о прошлом. 
                                   "Haber" указывает, что гипотеза касается прошлого.''',
            'Пример:': 'Habrá anotado mal el número.<br>Должно быть, он неправильно записал номер.'
        }
    },
    'Futuro perfecto con Ir a': {
        '1: Действие будет завершено до другого момента в будущем': {
            'Использование 1:': 'Обещания и предсказания. Действие будет завершено до другого момента в будущем.',
            'В сочетании с:': 'Предложениями "Сослагательное наклонение 1".',
            'Пример:': '''Cuando vengas <u>voy a haber preparado</u> todo.<br>
                          Когда ты придёшь (сюда), я (уже) всё подготовлю.'''
        },
        '2: Недоверие о прошлом': {
            'Использование 2:': 'Удивление, недоверие, неодобрение или замешательство о прошлом.',
            'Пример:': '¿Qué se va a haber recibido en MGU?<br>Да какой МГУ он закончил?!'
        }
    },
    'Presente subjuntivo': {
        'Сослагательное наклонение 1': {
            'Использование 1:': 'Пожелания или требования. Придаточное предложение после "чтобы" или "что".',
            'В сочетании с:': 'Предложениями в настоящем или будущем времени.',
            'Примеры:': '''Ella quiere que la <u>ayudemos</u>.<br>Она хочет, чтобы мы ей помогли.<br>
                           No creo que él <u>se dé</u> cuenta.<br>Я не думаю, что он заметит.''',
            'Использование 2:': 'Обещания и предсказания. Условие в будущем. "Когда".',
            'В сочетании с:': 'Предложениями в будущем времени или в повелительном наклонении.',
            'Пример:': 'Te escribiré cuando <u>llegue</u> a la oficina.<br>Я напишу тебе, когда приеду в офис.',
            'Использование 3:': '"Возможно" (о настоящем времени или о будущем).',
            'Пример:': 'Quizás lo <u>intentemos</u> de nuevo.<br>Возможно, мы попытаемся снова.<br>'
        },
    },
    'Imperfecto subjuntivo': {
        'Сослагательное наклонение 2': {
            'Использование 1:': 'Пожелания или требования. Придаточное предложение после "чтобы" или "что".',
            'В сочетании с:': 'Предложениями в прошедшем времени.',
            'Схема:': 'Корень + ase|ara/iese|iera.',
            'Пример:': 'Ella nos pidió que la <u>ayudásemos</u>.<br>Она попросила нас, чтобы мы ей помогли.',
            'Использование 2:': 'Невероятное или невозможное условие, в настоящем времени и в будущем ("если бы").',
            'В сочетании с:': 'Предложениями "Следствие маловероятных условии "бы"".',
            'Пример:': 'Si <u>tuviese</u> una lancha iría a la isla.<br>Если бы у меня была лодка, я бы отправился на остров.'

        }
    },
    'Futuro subjuntivo': {
        'Сослагательное наклонение 3': {
            'Использование:': '''Вероятное и возможное условие, в будущем ("если" или "когда"). 
                                 Очень официально. Обычно в юридических текстах.''', 
            'В сочетании с:': 'Предложениями в будущем.',
            'Схема:': 'Корень + are/iere.',
            'Пример:': '''Si el proveedor no <u>entregare</u> el producto dentro de los tres días habiles, 
                            la empresa podrá rescindir el contrato.<br>
                          Если поставщик не доставит товар в течение трёх рабочих дней, компания сможет расторгнуть договор.'''
        }
    },
    'Pluscuamperfecto compuestos del subjuntivo': {
        'Сослагательное наклонение 2 в прошлом (так и не произошло)': {
            'Использование:': '''Условие, которое не исполнилось в прошлом и уже невозможно ("если бы"). 
                                 "Haber" отодвигает условие в прошлое.''',
            'В сочетании с:': 'Предложениями "Следствие невыполненного условия в прошлом "бы""',
            'Примеры:': '''Si ella me <u>hubiese dicho</u> que iba a venir con amigos, habría preparado más comida.<br>
                           Если бы она сказала мне, что она собиралась прийти с друзьями, 
                           я бы приготовил больше еды.<br>
                           Si mi abuela no <u>se hubiese muerto</u>, estaría viva. (Выражение)<br>
                           Если бы моя бабушка не умерла, она была бы жива.'''
        }
    },
    'Condicional indicativo': {
        '1: Следствие маловероятных условий "бы"': {
            'Использование 1:': 'Последствие если условие выполняется. Совет.',
            'В сочетании с:': 'Предложениями в сослагательном наклонении 2.',
            'Схема:': 'Инфинитив + ía.',
            'Примеры:': '''Si tuviese mis herramientas aquí lo <u>repararía</u>.<br>
                           Если бы у меня были здесь инструменты, я бы починил.<br>
                           Yo no iría a ese lugar.<br>Я бы туда не ходил.'''
        },
        '2: Предсказание в прошлом': {
            'Использование 2:': 'Предположение о будущем в прошлом.',
            'В сочетании с:': 'Предложениями в прошедшем времени.',
            'Пример:': 'Creí que <u>sería</u> más difícil.<br>Я думал, что <u>будет</u> сложнее.'
        }
    },
    'Condicional perfecto compuestas comunes': {
        'Следствие невыполненного условия в прошлом "бы"': {
            'Использование:': '''Последствие, которое не было выполнено в прошлом и уже невозможно. 
                                 "Haber" отодвигает последствие в прошлое.''',
            'В сочетании с:': 'Предложениями в "Сослагательное наклонение 2 в прошлом (так и не произошло)".',
            'Пример:': '''Si hubiésemos sabido cómo se comporta la gente aquí en año nuevo, 
                          <u>habríamos viajado</u> en otro momento.<br>
                          Если бы мы знали, как люди ведут себя здесь в Новый год, 
                          мы бы приехали в другой момент.'''
        }
    },
    'Podria haber': {
        'Возможность ограничена прошлым': {
            'Использование:': '''Действие, которое не произошло, но было возможно в прошлом. 
                                 "Haber" отодвигает возможность в прошлое.''',
            'Пример:': '''¡Podrías haber incendiado la casa con tus experimentos!<br>
                          Ты (же) мог поджечь дом своими экспериментами!'''
        }
    },
    'Deberia haber': {
        'Желательное поведение ограничено прошлым "следовало бы"': {
            'Использование:': 'Желаемое действие, которое не произошло и уже поздно.',
            'Пример:': '''<u>Deberíamos haber comprado</u> oro hace dos años.<br>
                          Нам следовало бы купить золото два года назад.'''
        }
    },
    'Puede haber': {
        '1: Гипотеза о прошлом': {
            'Использование 1:': 'Гипотеза о прошлом (низкий уровень уверенности). С "haber" гипотеза ограничена прошлым событием.',
            'Пример:': '''<u>Pueden haber cambiado</u> la clave y no nos han dicho nada.<br>
                          Может быть они сменили пароль и (пока) не сообщили нам об этом.'''
        },
        '2: (Отрицательное) утверждение о невозможности в прошлом': {
            'Использование 2:': 'Утверждение о невозможности в прошлом (только в отрицательных предложениях)',
            'Пример:': '''Yo <u>no puedo haber asesinado</u> al mayordomo pues a esa hora me encontraba en el teatro.<br>
                          Я не мог убить дворецкого, так как в это время я был в театре.'''
        }
    },
    'Debe haber': {
        'Вывод о прошлом': {
            'Использование:': 'Вывод о прошлом (высокий уровень уверенности). "Haber" отодвигает вывод на действие прошлого.',
            'Пример:': 'Debe haberse quedado dormido.<br>Должно быть, он проспал.'
        }
    }
}